app/Repositories/Admin/CategoryRepository.php

select `id`, `title`, `slug`, `parent_id`, `type` from `categories` where `categories`.`deleted_at` is null
---
    public function getAll()
    {
        return Category::query()
            ->select([
                'id',
                'title',
                'slug',
                'parent_id',
                'type'
            ])->get();

select `id`, `title`, `slug`, `parent_id`, `type` from `categories` where `type` = '1' and `categories`.`deleted_at` is null
---
    public function getCategoryByType($type)
    {
        return Category::query()
            ->select([
                'id',
                'title',
                'slug',
                'parent_id',
                'type'
            ])
            ->where('type', $type)
            ->get();