app/Repositories/Admin/CourseRepository.php

select `id`, `title`, `slug`, `description`, `actual_price`, `discount_price`, `is_active`, `course_lang`, `course_time`, `course_size`, `course_kind` from `courses` where `courses`.`deleted_at` is null
---
    public function getAll()
    {
        return Course::query()
            ->select([
                'id',
                'title',
                'slug',
                'description',
                'actual_price',
                'discount_price',
                'is_active',
//                'course_lang',
//                'course_time',
//                'course_size',
//                'course_kind'

            ])->get();

select `id`, `title`, `type` from `categories` where `type` = 1 and `categories`.`deleted_at` is null
---
    public function getCategory()
    {
        return Category::query()
            ->select([
                'id',
                'title',
                'type'
            ])
            ->where('type', 1)
            ->get();